{"/posts/":{"data":{"":"Deploy Continuos 14 Feb 2026 | Careernotes Deploy frequente além de uma boa prática técnica - é filosofia de vida contra procrastinação. Como fiz o deploy desse blog 31 Jan 2026 | Snippets Hugo + Hextra + Vercel em 30 minutos de setup Tags: #deploy #vercel #mvp Você não é perfeccionista, você é um medroso com uma desculpa 23 Jan 2026 | Careernotes Por que 15 projetos na gaveta não fazem de você um desenvolvedor, fazem de você um covarde organizado. Tags: #mvp#carreira#mentalidade#soft-skills"},"title":"_index"},"/posts/2026/01/medo-do-fracasso/":{"data":{"":"Troli | 23 Jan 2026 | Careernotes Nesse texto tento te fazer uma provocação necessária para desenvolvedores presos no ciclo do perfeccionismo paralisante, pois precisamos de mais MVPs imperfeitos no ar e menos produtos perfeitos no HD, Ainda mais porque o alvo da critica desse post sou exatamente eu. Mantive engavetada por muito a ideia desse blog que ficou apenas no meu localhost, pelo medo do fracasso e de achar que não fazia sentido fazer algo assim então por meses não consegui fazer o 1° post nem mesmo fazer um deploy que tocasse o mundo real, pois fiz um planejamento enorme, documentei demais como se procastinasse para esse projeto se tornar tangivel e acabei ficando paralisado.\nEsse texto abaixo teve auxilio de I.A na escrita. Pois é, eu estou usando “muletas”, mas para meu bem esse foi o melhor que pude fazer por agora espero que no futuro consiga fazer tudo sozinho sem auxilio nenhum de I.A, no entanto preciso apenas começar porque melhor publicar algo do que nunca publicar. Se eu continuar tentando controlar todas as variáveis não vou sair do lugar e vou continuar me enganando de que preciso fazer algo perfeito que todos vão amar, mas isso não passa de uma desculpa e quem é bom em dar desculpa, não precisa ser bom em nada!\nÉ exatamente por isso que idealizei o Troli’s Mind para ser um espaço onde eu possa escrever, errar, melhorar - sem precisar ter algo perfeito apenas algo feito.","aceitando-ser-imperfeito#Aceitando ser imperfeito":"O desenvolvedor que nunca lança nada por medo da imperfeição comete o erro mais grave possível: privar o mundo de soluções potenciais em nome de padrões impossíveis.\nA tecnologia avança através de iteração, não de revelação divina. Facebook começou feio, Twitter era limitado, WhatsApp era básico. O que os tornou grandes não foi a perfeição inicial — foi a coragem de começar imperfeito e melhorar continuamente.\nTodo projeto no seu HD representa uma oportunidade perdida de impactar alguém, resolver um problema, aprender algo novo. A perfeição é inimiga do progresso, e o medo do fracasso garante a sua irrelevância e de seu projeto.\nEsse post além de ser meu primeiro post também é quando será feito o deploy do Troli’s Mind para sair de uma ideia arquivada no meu GitHub para finalmente estar no ar e ver a luz do dia. Por mais que eu tenha usado I.A para estruturar a minha ideia original, copiei referências de outros textos estou feliz que finalmente comecei a dar vida a esse projeto.\nHora de fazer um deploy. Mesmo que seja só para ver o que acontece!","fail-fast-como-antídoto#Fail Fast como Antídoto":"O Vale do Silício não popularizou o “fail fast” por acaso. Esta filosofia reconhece uma verdade fundamental: falhar cedo e barato é infinitamente melhor do que falhar tarde e caro. Um MVP imperfeito no ar vale mais que um produto perfeito no HD.\nO conceito de Lean Startup revolucionou o desenvolvimento justamente por quebrar a ilusão de que planejamento excessivo previne fracassos. Como disse Steve Blank: “Nenhum plano de negócios resiste ao primeiro contato com clientes”.","fontes#Fontes":"Paralisia por Análise How to avoid analysis paralysis Estagnação na programação Perfeccionismo-Cadar P.A MVP Perfeccionismo na carreira Tabnews -\u003e P.A 2 MVP 2 P.A 3 MVP 3 Perfeccionismo profissional P.A 4 MVP 4 Perfeccionismo na Programação Fail Fast, Fail Often Lean Startup Method Fail Fast Engenharia Empirica\nTags: #mvp #carreira #mentalidade #soft-skills","metodologia-de-experimentação#Metodologia de Experimentação":"A engenharia de software experimental não é apenas uma disciplina acadêmica — é uma mentalidade. Cada projeto é um experimento, cada deploy é uma hipótese sendo testada. Esta perspectiva transforma falhas de catástrofes em dados.\nO desenvolvedor que abraça a experimentação entende que código não é arte — é ferramenta. A elegância técnica é secundária à utilidade prática. Um sistema feio que resolve um problema real vale mais que uma arquitetura elegante que ninguém usa.\nO maior obstáculo para lançar projetos não é técnico — é emocional. O ego do desenvolvedor se identifica com o código, transformando críticas ao produto em ataques pessoais. Esta fusão entre identidade profissional e output técnico paralisa a ação.\nA solução passa por separar o criador da criação. Seu código não é você. Seus bugs não definem sua competência. Seu MVP imperfeito não diminui seu valor como profissional.","os-15-projetos-inacabados#Os 15 projetos inacabados":"Todo desenvolvedor tem 15 projetos inacabados. O problema não é falta de habilidade técnica - é medo disfarçado de perfeccionismo. Este post é sobre parar de se enganar.\nTodo desenvolvedor conhece essa história: tem quinze projetos em seu GitHub, dez prontos para deploy, uma coleção crescente de domínios e uma paralisia que impede qualquer lançamento. O MVP que nunca vê a luz do dia (e se vê é totalmente esquecido) não é uma falha técnica — é uma falha psicológica.\nA paralisia por análise na programação não é apenas procrastinação disfarçada. É o resultado de uma cultura que simultaneamente exige perfeição e pune o erro. O desenvolvedor se encontra preso entre a necessidade de entregar algo funcional e o medo de que “ninguém vai usar isso aqui”.\nO perfeccionismo na carreira de TI se manifesta de forma peculiar: cada linha de código precisa ser impecável, cada funcionalidade deve cobrir todas as possibilidades, cada design precisa ser revolucionário. O resultado? Projetos que jamais saem da fase de “quase pronto”.\nEste comportamento reflete uma mentalidade tóxica que confunde qualidade com perfeição. A busca incessante pelo código perfeito, pela arquitetura ideal, pelo produto sem falhas cria um ciclo vicioso onde o desenvolvedor investe semanas refinando detalhes enquanto o core do problema permanece sem solução.\nA verdade incômoda é que desenvolvedores frequentemente se apaixonam mais pelo processo de criar do que pelo resultado de entregar. É mais confortável refatorar pela décima vez do que enfrentar o feedback real de usuários reais… isso se houverem usuários reais.","quebrando-esse-ciclo#Quebrando esse ciclo":"Defina “pronto” antes de começar: Estabeleça critérios mínimos de funcionalidade e PARE quando atingi-los. Resistir à tentação de “só mais uma feature” é uma habilidade que se desenvolve.\nImplemente deadlines artificiais: Sem pressão externa, crie pressão interna. Anuncie um prazo de lançamento publicamente — o constrangimento social é um motivador poderoso.\nComece pelo deployment: Configure CI/CD antes de escrever a primeira linha de código. Quando o deployment é automático, lançar deixa de ser um evento traumático.\nAbraçar o feedback negativo: Não tente agradar todos — tente resolver um problema específico para um grupo específico. Feedback negativo de quem não é seu público-alvo é irrelevante.\nA sugestão de transformar projetos inacabados em portfolio não é apenas organizacional — é terapêutica. Documentar o processo, as decisões técnicas e os aprendizados valida o esforço investido, mesmo sem um produto final.\nUm portfolio honesto, que inclui projetos inacabados com reflexões sobre por que foram abandonados, é mais valioso que uma lista de sucessos fabricados.","síndrome-do-impostor-tecnlógica#Síndrome do Impostor Tecnlógica":"A constante evolução tecnológica cria um paradoxo cruel: quanto mais você aprende, mais percebe que não sabe. Esta realidade alimenta a síndrome do impostor, fazendo desenvolvedores experientes questionarem sua competência constantemente.\nO problema se agrava quando a cultura da empresa ou da comunidade pune quem admite não saber algo. Code reviews que destacam ignorância ao invés de promover aprendizado, ambientes onde pedir ajuda é visto como fraqueza, e a romantização do “desenvolvedor ninja” que resolve tudo sozinho.\nO medo de errar na programação é particularmente absurdo porque programar É errar. Debugging não é uma atividade secundária — é o coração do desenvolvimento. Cada erro é informação, cada bug é conhecimento.\nQuando desenvolvedores evitam projetos desafiadores por medo de não conseguir, eles se privam exatamente da experiência que os tornaria capazes. É um ciclo autossabotador onde o medo do fracasso garante a estagnação."},"title":"Você não é perfeccionista, você é um medroso com uma desculpa"},"/posts/2026/02/como-fiz-deploy-blog/":{"data":{"":"Troli | 31 Jan 2026 | Snippets No post anterior, escrevi sobre como perfeccionismo é medo disfarçado. Depois de dizer tudo aquilo não posso ficar só na teoria — este post documenta o deploy real que finalmente tirou o Troli’s Mind do localhost. Porque o deploy de um blog estático com Hugo + Vercel levaria literalmente 10 minutos. Eu levei mais de 1 mês. O problema nem foi devido a complexidade na configuração — foi psicológico.\nSendo direto o processo técnico para mim levou uns 30 minutos. O processo mental de “pressionar os botões” levou semanas.\nSe você também tem projetos mofando no seu GitHub que nunca tocaram na realidade, este post pode ser útil para você que está lendo e para o meu eu do futuro, quando esquecer como configurei tudo isso.\nDo SDD para internet 0. Setup Local # Comandos que você realmente executou hugo new site trolismind cd trolismind git init. 1. Setup Local → GitHub Depois de ter o blog rodando em localhost:1313 com o Hugo+Hextra, o primeiro passo foi versionar isso no Git (não farei um tutorial de git, mas no futuro irei fazer um guia melhor). Agora Vou listar os comandos que usei para versiornar o código para mostrar como git é bem simples na real\n# Inicializar repositório Git git init # Adicionar todos os arquivos que quero versionar git add nome_arquivo ou . # Primeiro commit git commit -m \"🎉 Initial commit: Hugo + Hextra setup\" # Conectar com GitHub (crie o repo lá antes) git remote add origin https://github.com/DevTroli/trolisMind.git # Trocar o nome padrão da branch para Main por boas práticas git branch -M main # Enviar todo o código para o GitHub para versionar o código git push -u origin main 2. Vercel: Conectar e fazer o Deploy A) Criar conta na Vercel\nAcessei vercel.com Fiz login com minha conta do GitHub B) Importar o projeto do GitHub\nCliquei em “Add New Project” A Vercel detectou automaticamente meu repo trolisMind Selecionei ele C) Configuração do Build A Vercel não detectou automaticamente que era Hugo logo precisei ajustar\nConfigurações que usei:\nFramework Preset: Hugo Build Command: hugo --gc --minify Output Directory: public Install Command: (deixei vazio, Vercel resolve automaticamente) 4) Variáveis de ambiente (se necessário) No meu caso, não precisei configurar nenhuma env var nesse primeiro deploy. Mas se você tiver coisas como tokens de API ou configurações sensíveis, é aqui que vai.\n5) Deploy! Cliquei em “Deploy” e espere a mágica acontecer\nTempo total: ~2 minutos até a vercel fazer o build da aplicação e fazer o blog estar no ar.\nGerando a URL padrão da Vercel [nome_repo]+vercel.app: trolismind.vercel.app\n3. O Primeiro bug em produção Spoiler: O primeiro deploy não funcionou de primeira.\nO erro:\nError: failed to render pages: render of \"posttypes\" failed O que aconteceu: Tive um problema de layout nos posttypes e ele só apareceu depois do deploy em produção. No localhost tava funcionando, mas na Vercel deu pau.\nComo resolvi:\nLi o log de erro completo na Vercel (não só a primeira linha) Identifiquei que era um problema no template layouts/posttypes/list.html Voltei pro código local, corrigi o bug Fiz commit + push pro GitHub Vercel fez redeploy automático (bom demais a propósito) Tempo pra resolver: ~15 minutos debugando + 2 minutos esperando o novo deploy.\nLição aprendida: Bugs que não aparecem no hugo server -D podem aparecer em produção. Por isso é importante fazer deploy cedo, mesmo que o blog não esteja “perfeito”.\nStack Escolhida","0-setup-local#0. Setup Local":"","1-setup-local--github#1. Setup Local → GitHub":"","2-vercel-conectar-e-fazer-o-deploy#2. Vercel: Conectar e fazer o Deploy":"","3-o-primeiro-bug-em-produção#3. O Primeiro bug em produção":"","agora-é-só-continuar#Agora é só continuar":"No post anterior, falei sobre perfeccionismo como medo disfarçado. Este post seria meu jeito superar — mesmo que temporariamente — essa paralisia.\nO blog não está perfeito. Ainda tem bugs. Ainda falta muito conteúdo. E está tudo bem por agora.\nSe você também tem um projeto mofando no seu GitHub esperando o momento ideal: faça o deploy hoje. O feedback do mundo real vale mais que 100 horas de planejamento no localhost.\nHora de escrever o próximo post. E o próximo. E o próximo…","do-sdd-para-internet#Do SDD para internet":"","ferramentas-são-temporárias#Ferramentas São Temporárias":"O lance é que em 5 anos talvez eu migre esse blog pra outra stack. Ou não. Tanto faz.\nTecnologias mudam. Hugo pode cair em desuso. Vercel pode virar paga. JavaScript pode inventar um novo framework revolucionário (de novo).\nMas minha capacidade de adaptar, criar e recomeçar — isso não muda. E o mais importante: o conteúdo que eu escrever vai continuar relevante, independente da ferramenta que usei pra publicá-lo.\nMarkdown é Markdown. Posts sobre comunicação, carreira, e decisões técnicas não expiram porque mudei de gerador de site.\nNo fim, ferramentas são temporárias. Sua criatividade e habilidade de comunicar, não.","fontes#Fontes":"Documentação:\nHugo Docs Hextra Theme Vercel Docs Posts/recursos que ajudaram: Meu Novo Blog - Como Eu Fiz\nRepositório do blog: Troli’s Mind\nTags: #deploy #vercel #mvp","função-vs-estética#Função vs Estética":"Existe um dilema clássico em qualquer projeto pessoal: escolher entre o que resolve (função) e o que te empolga (estética). Um código impecável mas sem identidade é como um robô eficiente. Um design deslumbrante mas sem propósito é um castelo de areia.\nQueria uma stack perfeita: moderna, escalável, impressionante. Gastei horas comparando frameworks, lendo benchmarks, planejando arquiteturas. E não escrevi uma linha de conteúdo.\nAté que li este post no blog do Akita sobre como ele fez o blog dele. E uma mensagem fixou na minha mente:\n“O blog perfeito não existe — just fucking write!”\nPercebi que estava usando a escolha de tecnologia como desculpa sofisticada para não começar. Paralisia por análise disfarçada de “pesquisa técnica”.\nA real é que as melhores escolhas não são as mais modernas, mas as que te deixam focar no que importa. E pro Troli’s Mind, o que importa é escrever.","hugo--hextra#Hugo + Hextra":"Por que escolhi: Hugo é um gerador de sites estáticos notório por uma razão simples: é absurdamente rápido e direto ao ponto. Perfeito pra quem vem de contexto tech, mas quer desenvolver habilidades de escrita, não virar especialista em build pipelines.\nO workflow é super simples:\nEscrevo markdown no Obsidian Rodo hugo server pra ver localmente Faço git push Deploy automático acontece Não tem nada para se configurar. Não tem “hmm, deixa eu atualizar essas 17 dependências que ficaram vulneráveis”.\nSobre o Hextra: Me pareceu o tema ideal - minimalista, limpo, focado em conteúdo. E de graça. Quando vi o demo, pensei: “Perfeito. Não preciso customizar nada. Posso começar a escrever hoje.”\nE foi exatamente o que fiz.\nAlternativas que considerei:\nDjango? Seria como usar uma bazuca pra matar uma formiga. Framework web completo com ORM, admin panel, autenticação… pra servir markdown estático? Absurdo Total. Next.js? Era minha ideia original, mas… o setup inicial me travou. Configurar TypeScript, ESLint, Prettier, escolher entre Pages Router vs App Router, decidir sobre SSR vs SSG vs ISR… Cara, eu só queria escrever um post para começar o blog :(","o-que-esse-deploy-ensinou#O Que Esse Deploy Ensinou":"Fazer o deploy desse blog me ensinou mais sobre processo do que sobre tecnologia. Aqui vão as lições práticas que levei:\nTécnico:\nBugs em produção não são um bicho de 7 cabeças. Aquele erro de build que deu na Vercel? Foi resolvido em 15 minutos. Não foi um bicho de sete cabeças. É impressionante como Hugo compila tão rápido. hugo server → ver resultado em 2 segundos. Isso acelera MUITO o desenvolvimento. Psicológico:\nO pensamento de “ainda não estar pronto” me paralisava mais que qualquer bug real. Passei semanas preocupado com o que poderia dar errado. Quando finalmente fiz o deploy, a maioria dos meus medos era imaginários Feedback do mundo real \u003e mil horas de planejamento. No fim descobri que o layout dos posttypes tinha bug. No localhost, tava “funcionando”. Produção é o teste real.","stack-escolhida#Stack Escolhida":"","vercel#Vercel":"Por que escolhi: Uso Vercel há anos. Nunca me deu problema. É aquilo: “time que está ganhando não se mexe”.\nAlém da familiaridade, outros motivos seriam:\nGrátis pra projetos pessoais (com limites generosos) Deploy automático a cada push no GitHub Analytics embutido (simples \u0026 funcional) Preview deployments automáticos pra pull requests UI/UX excelente - não preciso ler docs pra entender Conectei o repo, cliquei em “Deploy”, esperei 2 minutos. Funcionou.\nAlternativas: Considerei brevemente Netlify e GitHub Pages, mas honestamente? Não tinha motivo pra trocar. Netlify oferece funcionalidades similares à Vercel (ambas são ótimas). GitHub Pages é ainda mais simples, mas tem algumas limitações com builds customizados.\nNo fim, escolhi Vercel porque já estava na minha zona de conforto. E nesse projeto, reduzir fricção era mais importante que explorar alternativas. Já tinha fricção mental suficiente. Não precisava adicionar fricção técnica também.\nSe você nunca usou nenhuma das três, todas funcionariam bem pro mesmo propósito. Escolha a que tiver melhor documentação pro seu caso."},"title":"Como fiz o deploy desse blog"},"/posts/2026/02/deploy-continuos/":{"data":{"":"Troli | 14 Feb 2026 | Careernotes","a-nocividade-de-não-fazer-deploys#A nocividade de não fazer deploys":"Não existe nada mais nocivo no desenvolvimento de software do que ficar meses sem fazer deploy para produção. É como deixar um carro na garagem por três meses e depois se surpreender quando ele não quer dar partida. Ou como abandonar uma caixa vazia por um ano e esperar que ela não se deteriore com o tempo - spoiler alert: ela vai se deteriorar sozinha.","botando-a-cara-a-tapas#Botando a cara a tapas":"[Linka com o Post 1 sobre medo e Post 2 sobre deploy] Passei muito tempo sem fazer deploy. Quando finalmente fiz, descobri que …","como-implementar-devidamente#Como Implementar devidamente":"[Passos concretos baseados no seu setup]\nGit push = deploy automático (seu caso) Testes básicos antes do deploy Rollback fácil se der merda","código-parado-é-código-morto#Código parado é código morto":"Minhas Conclusões…","deploy-contínuo-vs-o-deploy-perfeito#Deploy Contínuo vs \u0026ldquo;O Deploy perfeito\u0026rdquo;":"[Comparação prática]\nTabela visual:\nDeploy Contínuo Deploy “Perfeito” Bugs pequenos, fixes rápidos Bugs catastróficos, fixes lentos Feedback real constante Suposições acumuladas Confiança crescente Ansiedade crescente","fontes#Fontes":"Link 1 Link 2","o-que-mudou-depois-de-muitos-deploys#O Que Mudou Depois de muitos deploys":"[Conteudo sobre isso]","tldr-too-long-dindt-read#TL;DR (Too Long Dind\u0026rsquo;t Read)":"Deploy frequente além de uma boa prática técnica - é filosofia de vida contra procrastinação."},"title":"Deploy Continuos"},"/principios/":{"data":{"":"Sou desenvolvedor. Como muitos devs, sempre fui melhor lidando com sistemas do que explicando ideias complexas para pessoas fora desse mundo.\nEste blog é meu laboratório pessoal para resolver isso — enquanto documento minha jornada tech de forma que faça sentido daqui a 3 anos (inclusive pra mim).\nAqui escrevo primeiro para mim. Se ajudar outras pessoas no processo, melhor ainda.","a-filosofia-do-grail-diary#A Filosofia do “Grail Diary”":"Como o diário de Henry Jones em Indiana Jones, este blog funciona como um repositório pessoal de descobertas que só fazem sentido depois que você viveu a jornada.\nCada post registra não apenas o como, mas o porquê e o quando usar.\nPrincípios que guiam tudo aqui:\nAutenticidade \u003e Autoridade — experiência real, com erros e acertos Profundidade \u003e Velocidade — fundamentos que duram, não modas Contexto \u003e Receita — decisões técnicas com impacto humano Valor prático \u003e Performance intelectual Se não torna alguém melhor no que faz, não merece espaço.","o-convite#O Convite":"Troli’s Mind é para quem está cansado de conteúdo tech vazio e quer mais semântica do que sintaxe.\nNão prometo atalhos. Prometo perspectiva.\nSe você chegou até aqui, provavelmente queremos a mesma coisa: ser profissionais melhores, comunicadores mais claros e fazer tecnologia servir pessoas de verdade.\nSeja bem-vindo ao Troli’s Mind.","o-problema-que-tento-resolver#O Problema Que Tento Resolver":"A internet está cheia de:\ntutoriais rápidos opiniões rasas conteúdo sem contexto E vazia de explicações sobre:\nquando usar quando evitar por que isso deu errado Aqui o foco é o conhecimento que persiste, combinado com experiência real. Teoria sem prática é inútil. Prática sem teoria é perigosa.","o-que-você-vai-encontrar-aqui#O Que Você Vai Encontrar Aqui":"Troli’s Mind é um brain dump estruturado: um espaço onde conhecimento técnico fragmentado vira contexto, decisões e aprendizado real.\nMais do que ensinar como fazer, me interessa explicar:\npor que uma decisão foi tomada quando ela faz sentido e quais consequências ela teve para pessoas reais Tecnologia é ferramenta. Conteúdo e contexto vêm primeiro.","para-quem-é-e-para-quem-não-é#Para Quem É (E Para Quem Não É)":"É para você se:\njá saiu do básico e quer profundidade se preocupa com o porquê, não só o como trabalha com tecnologia e quer pensar melhor sobre ela Não é para quem:\nbusca tutoriais passo a passo quer consumo rápido e superficial não tem paciência para reflexão","tipos-de-conteúdo#Tipos de Conteúdo":"Análises técnicas Opinativas (RANT) Decisões de arquitetura explicadas com contexto (Deep Dives) Lições reais de carreira (Carrer Notes) Aprendizado prático de tecnologias (Snippets) Impacto humano de escolhas técnicas (Design) Curadoria de livros e recursos que valem o tempo (Library)"},"title":"Meu Grail Diary Tech"},"/sobre/":{"data":{"":"","-contato--redes#📫 Contato \u0026amp; Redes":"💼 LinkedIn 🐙 GitHub 📧 Email: brawlixo123@gmail.com","-idiomas#🌍 Idiomas":"🇧🇷 Português (nativo) 🇺🇸 Inglês (B2 - Upper Intermediate)","-minha-filosofia#💭 Minha Filosofia":"“O blog perfeito não existe — just fucking write!”\n— Fabio Akita\nDemorei pra entender isso. Passei semanas obcecado em escolher o gerador estático perfeito, configurar temas, otimizar SEO, criar taxonomias complexas — tudo menos o que realmente importava: escrever. Caí na armadilha clássica que o Akita descreve: gastei energia construindo a ferramenta ideal enquanto o músculo da comunicação atrofiava. Foi quando percebi que não precisava do blog perfeito, precisava de um lugar onde pudesse errar publicamente e aprender com o processo. O conteúdo não melhora a stack, e a stack não arruma habilidade de comunicação — só a prática constante de escrever faz isso. Então aqui estou, com um blog “suficientemente bom” e o compromisso de focar no que me trouxe aqui: documentar a jornada, organizar o caos interno e, principalmente, aprender a comunicar ideias técnicas de forma humana.\nFoi essa epifania que moldou os princípios que guiam este espaço:\n📝 Conteúdo \u003e Tecnologia: O que mais importa para mim é a comunicação que foi precisa para tomar as decisões técnicas na vida real, pois software não arruma software e sim habilidades humanas 🎯 Autenticidade \u003e autoridade: Escrevo a partir da trincheira, não do pedestal 🔬 Profundidade acima velocidade: Prefiro análises atemporais do que hypes passageiros 🔗 Conexão sobre conhecimento isolado: Cada post faz parte de uma teia maior de experiências e aprendizados","-minhas-crenças#🧠 Minhas crenças":"✅ Aprender é uma Maratona, não um Sprint ✅ Comunicar bem é tão importante quanto programar bem, por isso criei esse blog para melhor minha escrita e comunicação ✅ Errar é parte crucial do processo — por isso documento os erros tanto quanto os acertos ✅ O melhor código é aquele que resolve o problema e se comunica bem com o usuário, não só o programador","-minhas-experiências#🛠️ Minhas Experiências":"Acredito que tecnologia é ferramenta para resolver problemas reais. Meus projetos de software sempre buscam entregar valor prático e utilitário alinhado ao usuário ou eu mesmo.","-stack-técnico#💻 Stack Técnico":"Linguagens: Python, JavaScript Frameworks: Django, FastAPI ,React, Next.js, Bancos de Dados: PostgreSQL, Oracle DevOps: Docker, CI/CD (GitHub Actions), Kubernetes, Terraform Sistemas Operacional que uso: Linux (I use Arch btw haha)","prazer-eu-sou-o-troli-#Prazer, eu sou o Troli 🤝":"Um Desenvolvedor que está focado em aprimorar suas habilidades de comunicação por meio desse blog. Meu objetivo com este blog é simples, documentar minha jornada técnica e humana, criar um “backup dos meus conhecimentos” que me ajude a organizar ideias, compartilhar experiências reais e, quem sabe, inspirar outros pessoas a aprimorarem suas habilidades técnicas ou sociais."},"title":"Sobre Mim"}}